{
  "backend/main.mo": "Empty Motoko actor definition serving as the backend canister entry point.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features for Admin page route protection, role-based access control, and AuthContext integration with high confidence test coverage.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing component functionality, routing, authentication, and styling configuration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode CSS variables for UI theming including sidebar, charts, and semantic color tokens.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the React application titled 'Concept Delta'.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with six routes (home, dashboard, admin, about, test, result), wrapping with AuthProvider and protecting dashboard route with ProtectedRoute component.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, COEPian Initiative branding, YouTube/Telegram social links, and caffeine.ai attribution with UTM tracking parameters.",
  "frontend/src/components/GradientButton.tsx": "Reusable button component with navy-to-blue gradient background, three size variants (sm, default, lg), and hover scale effects.",
  "frontend/src/components/HeroSection.tsx": "Hero section component with MHT-CET practice test heading, COEPian design subtext, and gradient CTA button navigating to dashboard.",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing consistent structure with Navbar, main content area using Outlet for route rendering, and Footer.",
  "frontend/src/components/Navbar.tsx": "Responsive navigation bar with mobile menu, conditional authentication UI, role-based Admin link visibility, and principal ID display with shortened and full versions.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to home page and displays loading spinner during authentication checks.",
  "frontend/src/contexts/AuthContext.tsx": "AuthContext wrapping useInternetIdentity to provide authentication state (isAuthenticated, principalId, role) with admin role assignment based on hardcoded ADMIN_PRINCIPAL comparison.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing backend actor creation with identity-based authentication, returning anonymous or authenticated actor and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication using @dfinity/auth-client, managing login state, identity persistence, and delegation validation with configurable auth client options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for future React Query hooks for backend operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including brand colors (navy and light blue) and design tokens for borders, backgrounds, and UI components.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and wraps the app with InternetIdentityProvider and QueryClientProvider.",
  "frontend/src/pages/About.tsx": "Simple About page placeholder with heading and 'Coming soon' message.",
  "frontend/src/pages/Admin.tsx": "Admin page with authentication and role-based access control that redirects unauthenticated users to home and non-admin users to dashboard.",
  "frontend/src/pages/Dashboard.tsx": "Simple Dashboard page placeholder with heading and 'Coming soon' message.",
  "frontend/src/pages/Home.tsx": "Home page that renders the HeroSection component.",
  "frontend/src/pages/Result.tsx": "Result page that displays a dynamic ID from URL params with placeholder content.",
  "frontend/src/pages/Test.tsx": "Test page that displays a dynamic ID from URL params with placeholder content.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom theme extensions for colors (using OKLCH), border radius, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document tracking Concept Delta MHT-CET practice platform architecture, features, color scheme (navy/light blue), routing structure, Internet Identity auth, and role-based access control."
}