{
  "backend/main.mo": "Main Motoko actor implementing user profiles, question management (CRUD with filtering by class/subject/chapter), and test management (create, publish, fetch) with role-based access control using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting implementation of Create Test tab navigation, test creation form with dropdowns, dynamic question filtering by class/subject, selectable question list with thumbnails, and live selected question count display.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, components, pages, hooks, contexts, and utilities for the MHT-CET practice test application with admin panel and question/test management.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes including background, foreground, primary, secondary, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'Concept Delta' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, dashboard, admin, question gallery, create test, about, test, and result pages, wrapped in AuthProvider with protected route support.",
  "frontend/src/components/DeleteConfirmationModal.tsx": "Alert dialog modal component for confirming question deletion with question ID display, loading state during deletion, and cancel/confirm actions using shadcn/ui AlertDialog.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, COEPian Initiative branding, YouTube/Telegram social links, and caffeine.ai attribution with UTM tracking parameters.",
  "frontend/src/components/GradientButton.tsx": "Reusable button component with navy-to-blue gradient background, three size variants (sm/default/lg), hover scale/shadow effects, and disabled state styling.",
  "frontend/src/components/HeroSection.tsx": "Hero section component with large heading about MHT-CET practice tests, subtext about COEPian design, and gradient CTA button navigating to dashboard.",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing consistent page structure with Navbar at top, main content area with Outlet for nested routes, and Footer at bottom in flex column layout.",
  "frontend/src/components/Navbar.tsx": "Navigation bar component with responsive mobile menu, authentication status display (shortened and full principal ID), login/logout buttons, and conditional admin link based on user role.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to home page and shows a loading spinner during authentication check.",
  "frontend/src/components/QuestionCard.tsx": "Card component displaying question details including image, metadata (class level, subject, chapter), correct answer, marks, creation date, and a delete button.",
  "frontend/src/components/TestQuestionRow.tsx": "Selectable row component for displaying question summary with checkbox, thumbnail image, ID, chapter, answer, and marks in a compact format for test creation.",
  "frontend/src/contexts/AuthContext.tsx": "Authentication context provider that wraps Internet Identity integration, manages authentication state, determines user role (admin/student) based on hardcoded principal whitelist, and provides login/logout functions.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with proper identity configuration, initializes access control with admin token from URL params, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider for Internet Identity authentication, managing AuthClient lifecycle, identity persistence, login/logout flows, and providing authentication status states.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including creating/deleting questions, fetching all questions, creating tests, and updating test status with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, including brand colors (navy and light blue), sidebar styling, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/About.tsx": "Placeholder About page component with basic layout and \"Coming soon\" message.",
  "frontend/src/pages/Admin.tsx": "Admin-only page for creating questions with image upload, classification fields (class, subject, chapter), answer selection, and marks assignment. Includes image compression, form validation, and authentication checks.",
  "frontend/src/pages/CreateTest.tsx": "Admin-only page for creating tests by selecting questions filtered by class and subject, with test configuration (name, duration, marks per question) and test status management.",
  "frontend/src/pages/Dashboard.tsx": "Placeholder Dashboard page component with basic layout and \"Coming soon\" message.",
  "frontend/src/pages/Home.tsx": "Home page component that renders the HeroSection component.",
  "frontend/src/pages/QuestionGallery.tsx": "Admin-only page displaying all questions in a filterable gallery with delete functionality, supporting filters by class, subject, and chapter search.",
  "frontend/src/pages/Result.tsx": "Placeholder Result page component that displays a result ID from URL params with \"Coming soon\" message.",
  "frontend/src/pages/Test.tsx": "Placeholder Test page component that displays a test ID from URL params with \"Coming soon\" message.",
  "frontend/src/utils/imageCompression.ts": "Utility function that compresses images exceeding 1MB by resizing to max 1920px and reducing quality, returning a Uint8Array for upload.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting values from query strings and hash-based routing, with sessionStorage persistence and cleanup functions for managing parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color scheme using OKLCH color space with CSS variables, extended theme for borders, shadows, animations (accordion), and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state file documenting Concept Delta MHT-CET practice platform with navy/light blue branding, route structure, Internet Identity authentication, role-based access control, and implemented features including navbar, footer, hero section, and question management with optional images."
}