{
  "backend/main.mo": "Main Motoko actor implementing user profiles, question management (CRUD with metadata like classLevel, subject, chapter), test management (create, publish, assign), and test submission tracking, all protected by role-based access control (admin/user permissions) using MixinStorage and MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting implemented validation requirements for Admin.tsx Create Question form, including required dropdowns for classLevel (11th/12th) and subject (Physics/Chemistry/Maths), required chapter text input, comprehensive form validation, and preservation of optional image-only workflow.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, authentication context with admin role assignment via ADMIN_PRINCIPALS array, Admin.tsx with validated question creation form, QuestionGallery with filtering and delete functionality, and utility functions for image compression.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining CSS variables for light and dark themes, including custom brand colors and shadcn/ui design tokens for consistent theming across the application.",
  "frontend/index.html": "HTML entry point with viewport meta tag, 'Concept Delta' title, root div for React mounting, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, dashboard (protected), admin, question gallery, create test, about, test, and result pages, wrapped in AuthProvider context.",
  "frontend/src/components/DeleteConfirmationModal.tsx": "Reusable AlertDialog component for confirming question deletion with question ID display, loading state during deletion, destructive styling, and cancel/confirm actions.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright, COEPian Initiative branding, YouTube/Telegram social links, and caffeine.ai attribution with dynamic UTM tracking based on hostname.",
  "frontend/src/components/GradientButton.tsx": "Reusable button component with navy-to-blue gradient background, three size variants (sm/default/lg), hover scale and shadow effects, and disabled state styling.",
  "frontend/src/components/HeroSection.tsx": "Hero section component with large heading about MHT-CET practice tests, COEPian design subtext, and gradient CTA button navigating to dashboard.",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing consistent page structure with Navbar at top, Outlet for route content in flex-1 main area, and Footer at bottom.",
  "frontend/src/components/Navbar.tsx": "Navigation bar component with responsive mobile menu, logo, navigation links (Home, About, Admin), and authentication UI showing principal ID with login/logout buttons.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to home page and displays a loading spinner during authentication checks.",
  "frontend/src/components/QuestionCard.tsx": "Card component displaying question details including image, class level, subject, chapter, correct answer, marks, creation date, and a delete button.",
  "frontend/src/components/TestQuestionRow.tsx": "Selectable row component for displaying question summary with checkbox, thumbnail image, ID, chapter, answer, and marks in a test creation interface.",
  "frontend/src/contexts/AuthContext.tsx": "Authentication context provider managing Internet Identity login/logout, principal ID, loading states, and role-based access (admin/student) based on hardcoded admin principal list.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializes access control with admin token, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider for Internet Identity authentication, managing AuthClient creation, login flow, identity persistence, and authentication status states.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend operations including creating/deleting questions, fetching all questions, creating tests, and updating test status with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, including color schemes for UI components, charts, sidebar, and brand colors (navy and light blue).",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/About.tsx": "Simple About page component displaying a placeholder message indicating the page is coming soon.",
  "frontend/src/pages/Admin.tsx": "Admin page for creating questions with image upload, classification fields (class level, subject, chapter), answer selection, and marks assignment. Includes authentication/authorization checks, form validation, image compression, and success/error handling.",
  "frontend/src/pages/CreateTest.tsx": "Admin page for creating tests by selecting questions filtered by class and subject, with form fields for test name, duration, and marks per question. Includes validation, question selection UI, and test status management.",
  "frontend/src/pages/Dashboard.tsx": "Simple Dashboard page component displaying a placeholder message indicating the page is coming soon.",
  "frontend/src/pages/Home.tsx": "Home page component that renders the HeroSection component as the main landing page content.",
  "frontend/src/pages/QuestionGallery.tsx": "Admin page displaying all questions in a filterable gallery with class, subject, and chapter filters. Includes question deletion functionality with confirmation modal and success/error handling.",
  "frontend/src/pages/Result.tsx": "Result page component that extracts test ID from URL params and displays a placeholder message indicating the page is coming soon.",
  "frontend/src/pages/Test.tsx": "Test page component that extracts test ID from URL params and displays a placeholder message indicating the page is coming soon.",
  "frontend/src/utils/imageCompression.ts": "Utility function that compresses image files exceeding a size threshold using HTML canvas, resizing to max 1920px while maintaining aspect ratio and applying quality compression, returning a Uint8Array.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and parameter cleanup functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines a custom design system with OKLCH color variables for theming (including brand navy/blue colors), container settings, border radius utilities, custom animations for accordions, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking file for Concept Delta MHT-CET practice platform, documenting architectural decisions (navy/blue color scheme, Internet Identity auth, role-based access control), implemented features (routing, navbar, footer, hero section, test/question management), and the current project version (29)."
}