{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Question Creation Form Validation and Delete Functionality",
  "requirements": [
    {
      "id": "REQ-81",
      "summary": "Make classLevel dropdown required with validation for '11th' and '12th' options in Create Question form",
      "acceptanceCriteria": [
        "Class Level dropdown has exactly two options: '11th' and '12th'",
        "Error message displays if user attempts to submit without selecting a class level",
        "Form submission is blocked until class level is selected"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Update the classLevel dropdown to be a required field with hardcoded options '11th' and '12th'. Add validation state tracking for classLevel. Display validation error message below the dropdown when user attempts to submit without selection. Ensure the field is visually marked as required and the form cannot submit until a value is selected."
        }
      ]
    },
    {
      "id": "REQ-82",
      "summary": "Make subject dropdown required with validation for 'Physics', 'Chemistry', and 'Maths' options in Create Question form",
      "acceptanceCriteria": [
        "Subject dropdown has exactly three options: 'Physics', 'Chemistry', and 'Maths'",
        "Error message displays if user attempts to submit without selecting a subject",
        "Form submission is blocked until subject is selected"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Update the subject dropdown to be a required field with hardcoded options 'Physics', 'Chemistry', and 'Maths'. Add validation state tracking for subject. Display validation error message below the dropdown when user attempts to submit without selection. Ensure the field is visually marked as required and the form cannot submit until a value is selected."
        }
      ]
    },
    {
      "id": "REQ-83",
      "summary": "Make chapter/topic name text input required with validation in Create Question form",
      "acceptanceCriteria": [
        "Chapter/Topic text input field is marked as required",
        "Error message displays if user attempts to submit with empty chapter field",
        "Form submission is blocked until chapter field contains text",
        "Admin must manually type the chapter name (no dropdown)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Update the chapter text input to be a required field. Add validation state tracking for chapter. Display validation error message below the input when user attempts to submit with empty value. Ensure the field is visually marked as required with an asterisk or required indicator, and the form cannot submit until text is entered."
        }
      ]
    },
    {
      "id": "REQ-84",
      "summary": "Implement comprehensive form validation preventing submission unless classLevel, subject, and chapter are filled, ensuring all three are sent to backend",
      "acceptanceCriteria": [
        "Form validation checks all three fields before allowing submission",
        "Backend createQuestion call always includes classLevel, subject, and chapter fields",
        "Validation runs on form submit and displays all relevant errors simultaneously",
        "Submit button remains disabled or shows validation errors until all required fields are filled"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Add a validation function that checks all three required fields (classLevel, subject, chapter) before form submission. On submit attempt, validate all fields simultaneously and display all relevant error messages at once. Track validation state for each field in component state. Ensure the createQuestion backend call always includes these three parameters regardless of other field states. Consider disabling the submit button or showing a validation summary until all required fields are valid."
        }
      ]
    },
    {
      "id": "REQ-85",
      "summary": "Preserve existing image-only workflow where questionText and option text fields remain optional",
      "acceptanceCriteria": [
        "Question text field remains optional",
        "Option A, B, C, D text fields remain optional",
        "Questions can be created with only images (no text required for question or options)",
        "Existing image upload and preview functionality is preserved"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Verify that questionText and all option text fields remain optional during the validation changes. Ensure validation logic only applies to classLevel, subject, and chapter fields. Maintain all existing image upload, compression, and preview functionality without changes. Do not add required validation to any image-related or text content fields."
        }
      ]
    },
    {
      "id": "REQ-87",
      "summary": "Refresh question list, update total count, and show success message after successful question deletion in QuestionGallery",
      "acceptanceCriteria": [
        "Question list automatically refreshes after deletion by invalidating the getAllQuestions query",
        "Total questions count updates to reflect the new total",
        "Success message appears confirming the question was deleted",
        "UI updates without requiring manual page refresh"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/QuestionGallery.tsx",
          "operation": "modify",
          "description": "Update the delete question handler to invalidate the getAllQuestions query after successful deletion, triggering an automatic refetch. Add toast notification or alert to display a success message confirming deletion. Ensure the total question count is recalculated from the refreshed data. The UI should update automatically without requiring manual page reload."
        }
      ]
    },
    {
      "id": "REQ-88",
      "summary": "Add error handling to QuestionGallery delete functionality displaying error message when deletion fails",
      "acceptanceCriteria": [
        "Error message displays when deleteQuestion backend call fails",
        "Error message clearly indicates deletion was unsuccessful",
        "User can dismiss the error message and retry if needed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/QuestionGallery.tsx",
          "operation": "modify",
          "description": "Add error handling in the delete question handler to catch failures from the deleteQuestion backend call. Display a toast notification or alert with a clear error message when deletion fails. Ensure the error message is user-friendly and dismissible, allowing the user to retry the operation if needed."
        }
      ]
    }
  ]
}